<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  




<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="随笔," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x9898;&amp;#x8BB0;&amp;#xFF1A;&amp;#x524D;&amp;#x7AEF;&amp;#x5F00;&amp;#x53D1;&amp;#x5DE5;&amp;#x7A0B;&amp;#x5E08;&amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x975E;&amp;#x5E38;&amp;#x7279;&amp;#x6B8A;&amp;#x7684;&amp;#x804C;&amp;#x4E1A;&amp;#xFF0C;&amp;#x548C;&amp;#x5F88;&amp;#x591A;&amp;#x8BA1;">
<meta property="og:type" content="article">
<meta property="og:title" content="前端路上,做好10件事,你就能成为大牛">
<meta property="og:url" content="http://yoursite.com/toBeBest/index.html">
<meta property="og:site_name" content="Susan的博客">
<meta property="og:description" content="&amp;#x9898;&amp;#x8BB0;&amp;#xFF1A;&amp;#x524D;&amp;#x7AEF;&amp;#x5F00;&amp;#x53D1;&amp;#x5DE5;&amp;#x7A0B;&amp;#x5E08;&amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x975E;&amp;#x5E38;&amp;#x7279;&amp;#x6B8A;&amp;#x7684;&amp;#x804C;&amp;#x4E1A;&amp;#xFF0C;&amp;#x548C;&amp;#x5F88;&amp;#x591A;&amp;#x8BA1;">
<meta property="og:updated_time" content="2016-04-25T02:17:59.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="前端路上,做好10件事,你就能成为大牛">
<meta name="twitter:description" content="&amp;#x9898;&amp;#x8BB0;&amp;#xFF1A;&amp;#x524D;&amp;#x7AEF;&amp;#x5F00;&amp;#x53D1;&amp;#x5DE5;&amp;#x7A0B;&amp;#x5E08;&amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x975E;&amp;#x5E38;&amp;#x7279;&amp;#x6B8A;&amp;#x7684;&amp;#x804C;&amp;#x4E1A;&amp;#xFF0C;&amp;#x548C;&amp;#x5F88;&amp;#x591A;&amp;#x8BA1;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"right","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 前端路上,做好10件事,你就能成为大牛 | Susan的博客 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?7461c9f48f91cce92bed615b46379a78";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-right page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Susan的博客</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">你以为的永远不是你以为的</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-th fa-fw"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="#" class="st-search-show-outputs">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <form class="site-search-form">
  <input type="text" id="st-search-input" class="st-search-input st-default-search-input" />
</form>

<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
    (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
    e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

  _st('install', 'furY6FHJsPf3MDwJFvjf','2.0.0');
</script>



    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                前端路上,做好10件事,你就能成为大牛
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-04-12T15:28:24+08:00" content="2016-04-12">
              2016-04-12
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/随笔/" itemprop="url" rel="index">
                    <span itemprop="name">随笔</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/toBeBest/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="/toBeBest/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
              &nbsp; | &nbsp;
              <span class="page-pv"><i class="fa fa-file-o"></i>
              <span class="busuanzi-value" id="busuanzi_value_page_pv" ></span>
              </span>
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x9898;&#x8BB0;&#xFF1A;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x7279;&#x6B8A;&#x7684;&#x804C;&#x4E1A;&#xFF0C;&#x548C;&#x5F88;&#x591A;&#x8BA1;&#x7B97;&#x673A;&#x76F8;&#x5173;&#x804C;&#x4E1A;&#x90FD;&#x4E0D;&#x5C3D;&#x76F8;&#x540C;,&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x804C;&#x4E1A;&#x9886;&#x57DF;&#x4E2D;&#x6700;&#x590D;&#x6742;&#x7684;&#x4E00;&#x4E2A;&#x5DE5;&#x79CD;,&#x73B0;&#x5728;&#x5F88;&#x591A;&#x62DB;&#x8058;&#x7F51;&#x7AD9;&#x90FD;&#x5728;&#x70ED;&#x62DB;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E2A;&#x804C;&#x4E1A;&#x662F;&#x968F;&#x7740;&#x4E92;&#x8054;&#x7F51;&#x53D1;&#x5C55;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x662F;&#x4ECE;&#x8BBE;&#x8BA1;&#xFF0C;&#x5F00;&#x53D1;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x9886;&#x57DF;&#x8F6C;&#x8FC7;&#x6765;&#x7684;&#xFF0C;&#x6C34;&#x5E73;&#x53C2;&#x5DEE;&#x4E0D;&#x9F50;&#xFF0C;&#x4E0D;&#x8FC7;&#xFF0C;&#x505A;&#x597D;&#x4EE5;&#x4E0B;10&#x4EF6;&#x4E8B;&#xFF0C;&#x4F60;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x524D;&#x7AEF;&#x7684;&#x5927;&#x725B;&#xFF01;</p>
<a id="more"></a>
<p>1.&#x4E0D;&#x8981;&#x5FFD;&#x89C6;html&#x7684;&#x57FA;&#x7840;</p>
<p>&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x8BA4;&#x4E3A;html&#x5982;&#x6B64;&#x7B80;&#x5355;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x4E0D;&#x5C51;&#x4E00;&#x987E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x73B0;&#x5728;&#x8FD8;&#x8FD9;&#x6837;&#x89C9;&#x5F97;&#xFF0C;&#x4F60;&#x5C31;&#x5927;&#x9519;&#x7279;&#x9519;&#x4E86;&#xFF0C;&#x5F88;&#x591A;&#x516C;&#x53F8;&#xFF08;&#x963F;&#x91CC;&#x7CFB;&#x5C24;&#x91CD;&#xFF09;&#x5728;&#x7B14;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x975E;&#x5E38;&#x770B;&#x91CD;html&#x8BED;&#x4E49;&#x5316;,&#x5408;&#x7406;&#x7684;&#x8BED;&#x4E49;&#x5316;&#x53EF;&#x4EE5;&#x5E26;&#x6765;&#x7F51;&#x9875;&#x66F4;&#x5FEB;&#x7684;&#x89E3;&#x6790;&#x901F;&#x5EA6;&#xFF0C;&#x4FBF;&#x4E8E;&#x56E2;&#x961F;&#x5F00;&#x53D1;,&#x514B;&#x519B;&#x7684;&#x535A;&#x5BA2;&#x6709;&#x4E00;&#x7BC7;&#x4F60;&#x771F;&#x7684;&#x4E86;&#x89E3;html&#x5417;&#xFF1F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x53BB;&#x770B;&#x770B;&#xFF0C;&#x5269;&#x4E0B;&#x5173;&#x4E8E;&#x5408;&#x7406;&#x7684;&#x8BED;&#x4E49;&#x5316;&#x80FD;&#x5E26;&#x6765;&#x591A;&#x5C11;&#x597D;&#x5904;&#xFF0C;&#x4E00;&#x641C;&#x4E00;&#x5927;&#x628A;&#x3002;</p>
<p>2.&#x5BF9;&#x771F;&#x50CF;&#x7684;&#x6E34;&#x6C42;</p>
<p>&#x524D;&#x7AEF;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x975E;&#x5E38;&#x96F6;&#x6563;&#x7684;&#xFF0C;&#x5C31;&#x62FF;&#x5904;&#x7406;css bug &#x65B9;&#x4FBF;&#xFF0C;&#x6574;&#x4E2A;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x8DEF;&#x4E0A;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x8981;&#x9047;&#x5230;&#x591A;&#x5C11;&#xFF0C;&#x8BB0;&#x4F4F;&#xFF1A;&#x6BCF;&#x4E00;&#x4E2A;bug&#x7684;&#x4EA7;&#x751F;&#xFF0C;&#x90FD;&#x5BF9;&#x4E8E;&#x4F60;&#x662F;&#x4E00;&#x6B21;&#x673A;&#x4F1A;&#xFF0C;&#x641E;&#x5B9A;&#x5B83;&#xFF0C;&#x4F60;&#x7684;&#x6B66;&#x529F;&#x5C31;&#x4E0A;&#x5347;&#x4E86;&#x4E00;&#x4E2A;&#x5C42;&#x6B21;&#xFF0C;&#x6BCF;&#x4E2A;CSS BUG&#x90FD;&#x6697;&#x85CF;&#x7384;&#x673A;&#xFF0C;&#x6536;&#x96C6;&#x6574;&#x7406;&#x5E76;&#x8BB0;&#x5F55;&#x4ED6;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E00;&#x65F6;&#x4E4B;&#x9700;</p>
<p>3.&#x628A;&#x6700;&#x96BE;&#x5543;&#x7684;&#x9AA8;&#x5934;&#x5543;&#x6389;&#x2014;&#x2014;javascript</p>
<p>&#x524D;&#x7AEF;&#x7684;&#x57FA;&#x672C;&#x6280;&#x80FD;&#x662F;html+css+javascript&#xFF0C;&#x53EA;&#x61C2;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x8FD8;&#x4E0D;&#x884C;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x5BF9;&#x8FD9;&#x4E09;&#x95E8;&#x8BED;&#x8A00;&#x90FD;&#x5F88;&#x719F;&#x6089;&#x3002;&#x4E5F;&#x4E0D;&#x662F;&#x8BF4;&#x5FC5;&#x987B;&#x5BF9;&#x8FD9;&#x4E09;&#x95E8;&#x8BED;&#x8A00;&#x90FD;&#x975E;&#x5E38;&#x7CBE;&#x901A;&#xFF0C;&#x4F46;&#x4F60;&#x81F3;&#x5C11;&#x8981;&#x80FD;&#x591F;&#x8FD0;&#x7528;&#x5B83;&#x4EEC;&#x5B8C;&#x6210;&#x5927;&#x591A;&#x6570;&#x4EFB;&#x52A1;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x5730;&#x9891;&#x7E41;&#x5730;&#x5BFB;&#x6C42;&#x522B;&#x4EBA;&#x7684;&#x5E2E;&#x52A9;&#x3002;&#x5F80;&#x5F80;js&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#xFF0C;&#x6BD4;&#x8F83;&#x96BE;&#xFF0C;&#x5C24;&#x5176;&#x5BF9;&#x4E8E;&#x975E;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x51FA;&#x8EAB;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x522B;&#x6015;&#xFF0C;&#x6162;&#x6162;&#x6765;&#xFF0C;&#x4F60;&#x7EC8;&#x7A76;&#x4F1A;&#x641E;&#x5B9A;&#x4ED6;&#xFF0C;&#x63A8;&#x8350;&#x300A;javascript&#x6743;&#x5A01;&#x6307;&#x5357;(&#x7B2C;&#x4E94;&#x7248;)&#x300B;</p>
<p>4.&#x4E0D;&#x8981;&#x52A0;&#x5165;&#x4E00;&#x5BB6;&#x56FD;&#x4F01;&#x8F6F;&#x4EF6;&#x516C;&#x53F8;&#x53BB;&#x505A;&#x8F6F;&#x4EF6;</p>
<p>&#x524D;&#x7AEF;&#x662F;&#x4E3A;&#x4E86;&#x4E92;&#x8054;&#x7F51;&#x800C;&#x751F;&#x7684;,&#x4E2D;&#x56FD;&#x7684;&#x8F6F;&#x4EF6;&#x6709;&#x591A;&#x843D;&#x540E;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x5417;&#xFF1F;&#x300A;&#x8D70;&#x51FA;&#x8F6F;&#x4EF6;&#x4F5C;&#x574A;&#x300B; &#x6216;&#x8BB8;&#x80FD;&#x5E2E;&#x4F60;&#x770B;&#x6E05;&#x4E2D;&#x56FD;&#x8F6F;&#x4EF6;&#x73B0;&#x72B6;&#xFF0C;&#x8001;&#x677F;&#x4ECE;&#x6765;&#x4E0D;&#x5173;&#x5FC3;&#x56E2;&#x961F;&#x5EFA;&#x8BBE;&#xFF0C;&#x4E5F;&#x4E0D;&#x5173;&#x5FC3;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x662F;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF0C;&#x901A;&#x5E38;&#x8FD9;&#x6837;&#x7684;&#x516C;&#x53F8;&#x73B0;&#x72B6;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;&#x4E00;&#x4E2A;&#x90E8;&#x95E8;&#x6709;&#x4E00;&#x4E2A;&#x7F8E;&#x5DE5;&#xFF0C;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x6709;&#x4E00;&#x4E2A;&#x7F8E;&#x5DE5;&#xFF0C;&#x6240;&#x6709;&#x9875;&#x9762;&#x7684;&#x8BBE;&#x8BA1;&#x6765;&#x6E90;&#x662F;&#x4E00;&#x4E2A;&#x53EB;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x6216;&#x8005;&#x540E;&#x53F0;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x6CA1;&#x6587;&#x6863;&#xFF0C;&#x6CA1;&#x9700;&#x6C42;&#xFF0C;&#x7F8E;&#x5DE5;&#x6309;&#x7167;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x53BB;&#x62FC;&#x51D1;&#x9875;&#x9762;&#xFF0C;&#x957F;&#x6B64;&#x4EE5;&#x5F80;&#xFF0C;&#x8FD9;&#x4E2A;&#x524D;&#x7AEF;&#x7684;&#x6280;&#x80FD;&#x4F1A;&#x9010;&#x6E10;&#x9000;&#x5316;&#xFF0C;&#x5F88;&#x591A;&#x601D;&#x60F3;&#x4F1A;&#x70DF;&#x6D88;&#x4E91;&#x6563;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7ACB;&#x5FD7;&#x505A;&#x524D;&#x7AEF;&#xFF0C;&#x5343;&#x4E07;&#x522B;&#x52A0;&#x5165;&#x8FD9;&#x6837;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x5373;&#x4F7F;&#x56E0;&#x4E3A;&#x6682;&#x65F6;&#x7684;&#x5229;&#x76CA;&#xFF0C;&#x4E5F;&#x4E0D;&#x8981;&#x3002;&#x8981;&#x53BB;&#xFF0C;&#x5C31;&#x53BB;&#x6709;&#x4E00;&#x5BB6;&#x56E2;&#x961F;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x591A;&#x4E2A;&#x524D;&#x7AEF;&#xFF0C;&#x591A;&#x4E2A;&#x8BBE;&#x8BA1;&#xFF0C;&#x4EA4;&#x4E92;&#x4E00;&#x8D77;&#xFF0C;&#x6700;&#x597D;&#x662F;&#x8001;&#x677F;&#x77E5;&#x9053;&#x4F60;&#x7684;&#x804C;&#x4F4D;&#x540D;&#x5B57;&#x53EB;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;</p>
<p>5.&#x4E0D;&#x8981;&#x95ED;&#x95E8;&#x9020;&#x8F66;</p>
<p>&#x591A;&#x4E0E;&#x4EBA;&#x4EA4;&#x6D41;&#xFF0C;&#x5728;&#x524D;&#x7AEF;&#x9886;&#x57DF;&#x5C24;&#x5176;&#x91CD;&#x8981;&#xFF0C;&#x5F88;&#x591A;&#x601D;&#x60F3;&#x548C;&#x77E5;&#x8BC6;&#x90FD;&#x662F;&#x5728;&#x8BA8;&#x8BBA;&#x548C;&#x8111;&#x66B4;&#x4E2D;&#x79EF;&#x7D2F;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x95ED;&#x95E8;&#x9020;&#x8F66;&#x6C38;&#x8FDC;&#x884C;&#x4E0D;&#x901A;&#xFF0C;&#x81EA;&#x5DF1;&#x7814;&#x7A76;&#x4E2A;BUG&#x53EF;&#x80FD;&#x9700;&#x8981;2&#x5C0F;&#x65F6;&#xFF0C;&#x548C;&#x522B;&#x4EBA;&#x4EA4;&#x6D41;&#x53EF;&#x80FD;&#x53EA;&#x9700;&#x8981;5&#x5206;&#x949F;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4E0D;&#x8981;&#x9047;&#x5230;&#x95EE;&#x9898;&#x5C31;&#x95EE;&#x522B;&#x4EBA;&#xFF0C;&#x4F60;&#x8BE5;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x505A;&#x3002;</p>
<p>6.&#x4E0D;&#x8981;&#x4EE5;&#x9AD8;&#x624B;&#x81EA;&#x5C45;</p>
<p>&#x62E5;&#x6709;&#x8C26;&#x900A;&#x7684;&#x54C1;&#x8D28;&#x4E0D;&#x4EC5;&#x662F;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x5FC5;&#x5907;&#xFF0C;&#x4E5F;&#x662F;&#x505A;&#x4EBA;&#x7684;&#x57FA;&#x7840;&#x3002;&#x987B;&#x77E5;&#x5C71;&#x5916;&#x6709;&#x5C71;&#xFF0C;&#x4EBA;&#x5916;&#x6709;&#x4EBA;&#xFF0C;&#x8C26;&#x900A;&#x4F7F;&#x4F60;&#x770B;&#x7684;&#x66F4;&#x8FDC;&#x3002;</p>
<p>7.&#x4E0D;&#x94BB;&#x725B;&#x89D2;&#x5C16; </p>
<p>&#x524D;&#x7AEF;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6570;&#x4E0D;&#x80DC;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x5B9E;&#x5728;&#x641E;&#x4E0D;&#x5B9A;&#xFF0C;&#x4E0D;&#x5982;&#x6682;&#x65F6;&#x653E;&#x4E0B;&#xFF0C;&#x6682;&#x65F6;&#x8FDC;&#x79BB;&#x7535;&#x8111;&#xFF0C;&#x770B;&#x770B;&#x7A97;&#x5916;&#x7684;&#x98CE;&#x666F;&#xFF0C;&#x542C;&#x542C;&#x8F7B;&#x97F3;&#x4E50;&#xFF0C;&#x548C;&#x670B;&#x53CB;&#x804A;&#x804A;&#x5929;&#x3002;&#x5F53;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4F1A;&#x53D1;&#x73B0;&#x90A3;&#x4E9B;&#x96BE;&#x9898;&#x73B0;&#x5728;&#x7ADF;&#x7136;&#x53EF;&#x4EE5;&#x8FCE;&#x5203;&#x800C;&#x89E3;&#x3002;<br>8.&#x4E0D;&#x8981;&#x5B66;&#x9ED1;&#x778E;&#x5B50;&#x63B0;&#x7389;&#x7C73;(&#x61C2;&#x5F97;&#x6574;&#x7406;)</p>
<p>&#x6211;&#x5E73;&#x65F6;&#x6700;&#x5927;&#x7684;&#x7231;&#x597D;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x5404;&#x4E2A;&#x524D;&#x7AEF;&#x7684;&#x535A;&#x5BA2;&#x4E0A;&#x901B;&#x6765;&#x901B;&#x53BB;&#xFF0C;&#x9047;&#x5230;&#x597D;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x6536;&#x5F55;&#x4E00;&#x4E0B;&#xFF0C;&#x77E5;&#x8BC6;&#x9700;&#x8981;&#x79EF;&#x7D2F;&#xFF0C;&#x8BF4;&#x4E0D;&#x51C6;&#x4F60;&#x54EA;&#x5929;&#x5C31;&#x4F1A;&#x9047;&#x5230;&#xFF0C;&#x5F53;&#x7136;&#x5EFA;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x535A;&#x5BA2;&#xFF0C;&#x8BB0;&#x5F55;&#x81EA;&#x5DF1;&#x7684;&#x5B66;&#x4E60;&#x5386;&#x7A0B;&#x662F;&#x6211;&#x975E;&#x5E38;&#x63A8;&#x8350;&#x7684;&#x505A;&#x6CD5;&#x3002;</p>
<p>9.&#x8981;&#x6709;&#x826F;&#x597D;&#x7684;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x89C4;&#x5212;</p>
<p>&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x524D;&#x7AEF;&#x8BBE;&#x8BA1;&#x5E08;&#xFF0C;&#x524D;&#x7AEF;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x524D;&#x7AEF;&#x6D4B;&#x8BD5;&#x2026;&#x2026;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x559C;&#x597D;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#x91CF;&#x8EAB;&#x6253;&#x9020;&#xFF0C;&#x505A;&#x597D;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x89C4;&#x5212;&#xFF0C;&#x6709;&#x76EE;&#x6807;&#x7684;&#x53BB;&#x5DE5;&#x4F5C;&#x5B66;&#x4E60;&#xFF0C;&#x4E00;&#x822C;&#x4ECE;&#x540E;&#x53F0;&#x5F00;&#x53D1;&#x8F6C;&#x8FC7;&#x6765;&#x7684;&#x4EBA;&#x66F4;&#x9002;&#x5408;&#x505A;&#x524D;&#x7AEF;&#x67B6;&#x6784;&#xFF0C;&#x5B66;&#x8BBE;&#x8BA1;&#x51FA;&#x8EAB;&#x7684;&#x66F4;&#x9002;&#x5408;&#x4E8E;&#x505A;&#x524D;&#x7AEF;&#x8BBE;&#x8BA1;&#x5E08;&#x3002;</p>
<p>10.&#x535A;&#x89C8;&#x7FA4;&#x4E66;&#xFF0C;&#x6D89;&#x730E;&#x5E7F;&#x6CDB;</p>
<p>&#x7EC8;&#x4E8E;&#x8BF4;&#x5230;&#x7B2C;&#x5341;&#x70B9;&#x4E86;&#xFF0C;&#x804C;&#x4E1A;&#x7684;&#x7279;&#x6B8A;&#x6027;&#xFF0C;&#x51B3;&#x5B9A;&#x4F60;&#x5FC5;&#x987B;&#x6D89;&#x730E;&#x5E7F;&#x6CDB;&#xFF0C;&#x501F;&#x7528;Nicholas C. Zakas&#x7684;&#x8BDD;&#x8BF4;&#xFF1A;&#x65E0;&#x8BBA;&#x4ECE;&#x54EA;&#x4E2A;&#x65B9;&#x9762;&#x8BB2;&#xFF0C;&#x6211;&#x90FD;&#x89C9;&#x5F97;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x804C;&#x4E1A;&#x9886;&#x57DF;&#x4E2D;&#x6700;&#x590D;&#x6742;&#x7684;&#x4E00;&#x4E2A;&#x5DE5;&#x79CD;&#x3002;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x4F20;&#x7EDF;&#x7684;&#x7F16;&#x7A0B;&#x601D;&#x60F3;&#x5DF2;&#x7ECF;&#x4E0D;&#x9002;&#x7528;&#x4E86;&#xFF0C;&#x4E3A;&#x4E86;&#x5728;&#x591A;&#x79CD;&#x5E73;&#x53F0;&#x4E2D;&#x4F7F;&#x7528;&#xFF0C;&#x591A;&#x79CD;&#x6280;&#x672F;&#x90FD;&#x501F;&#x9274;&#x4E86;&#x5927;&#x91CF;&#x8F6F;&#x79D1;&#x5B66;&#x7684;&#x77E5;&#x8BC6;&#x548C;&#x7406;&#x5FF5;&#x3002;&#x6210;&#x4E3A;&#x4F18;&#x79C0;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x6240;&#x8981;&#x5177;&#x5907;&#x7684;&#x4E13;&#x4E1A;&#x6280;&#x672F;&#xFF0C;&#x6D89;&#x53CA;&#x5230;&#x5E7F;&#x9614;&#x800C;&#x590D;&#x6742;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x8FD9;&#x4E9B;&#x9886;&#x57DF;&#x53C8;&#x4F1A;&#x56E0;&#x4E3A;&#x4F60;&#x6700;&#x7EC8;&#x5FC5;&#x987B;&#x670D;&#x52A1;&#x7684;&#x5404;&#x65B9;&#x7684;&#x4ECB;&#x5165;&#x800C;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x3002;&#x4E13;&#x4E1A;&#x6280;&#x672F;&#x53EF;&#x80FD;&#x4F1A;&#x5F15;&#x9886;&#x4F60;&#x8FDB;&#x5165;&#x6210;&#x4E3A;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x5927;&#x95E8;&#xFF0C;&#x4F46;&#x53EA;&#x6709;&#x8FD0;&#x7528;&#x8BE5;&#x6280;&#x672F;&#x521B;&#x9020;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE5;&#x53CA;&#x4F60;&#x8DDF;&#x4ED6;&#x4EBA;&#x5E76;&#x80A9;&#x534F;&#x540C;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x624D;&#x4F1A;&#x771F;&#x6B63;&#x8BA9;&#x4F60;&#x53D8;&#x5F97;&#x4F18;&#x79C0;&#x3002;</p>
<h4 id="&#x8F6C;&#x81EA;http-www-cnblogs-com-yizuierguo-archive-2010-05-15-1736053-html"><a href="#&#x8F6C;&#x81EA;http-www-cnblogs-com-yizuierguo-archive-2010-05-15-1736053-html" class="headerlink" title="&#x8F6C;&#x81EA;http://www.cnblogs.com/yizuierguo/archive/2010/05/15/1736053.html"></a>&#x8F6C;&#x81EA;<a href="http://www.cnblogs.com/yizuierguo/archive/2010/05/15/1736053.html" target="_blank" rel="external">http://www.cnblogs.com/yizuierguo/archive/2010/05/15/1736053.html</a></h4><p><span id="busuanzi_container_page_pv"><br>  &#x672C;&#x6587;&#x603B;&#x9605;&#x8BFB;&#x91CF;<span id="busuanzi_value_page_pv"></span>&#x6B21;<br></span></p>

      
    </div>
    
    <div>
      
        
      
    </div>

    <div>
      
        
      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/随笔/" rel="tag">#随笔</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/BuildBlog/" rel="next" title="快速创建自己的Blog（HEXO + GITHUB PAGE）">
                <i class="fa fa-chevron-left"></i> 快速创建自己的Blog（HEXO + GITHUB PAGE）
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/canyou/" rel="prev" title="适不适合做前端？">
                适不适合做前端？ <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="/toBeBest/"
           data-title="前端路上,做好10件事,你就能成为大牛" data-url="http://yoursite.com/toBeBest/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/logo2.jpg"
               alt="Susan" />
          <p class="site-author-name" itemprop="name">Susan</p>
          <p class="site-description motion-element" itemprop="description">前端，小白，开发</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">13</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">8</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">9</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/HappySusan/HappySusan.github.io" target="_blank" title="github">
                  
                    <i class="fa fa-globe"></i>
                  
                  github
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/jnan002" target="_blank" title="weibo">
                  
                    <i class="fa fa-globe"></i>
                  
                  weibo
                </a>
              </span>
            
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-4"><a class="nav-link" href="#转自http-www-cnblogs-com-yizuierguo-archive-2010-05-15-1736053-html"><span class="nav-number">1.</span> <span class="nav-text">转自http://www.cnblogs.com/yizuierguo/archive/2010/05/15/1736053.html</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Susan</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

<div class="busuanzi-count">

  <script async src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js"></script>

  
    <span class="site-uv"><i class="fa fa-user"></i><span class="busuanzi-value" id="busuanzi_value_site_uv"></span></span>
  

  
    <span class="site-pv"><i class="fa fa-eye"></i><span class="busuanzi-value" id="busuanzi_value_site_pv"></span></span>
  
  
</div>



        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"jnan002"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  

  

  

</body>
</html>
